//;******************************************************************************
//;* Copyright (c) 1983-2014, Insyde Software Corporation. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
// *++
//
// Copyright (c) 2004, Intel Corporation
// All rights reserved. This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   Strings.vfr
//
// Abstract:
//
//   String definitions for BdsPlatform formset.
//
// Revision History:
//
// --*/

/=#

#langdef eng "English"
#langdef fra "Français"
#langdef zho "\wide中文\narrow"
#langdef jpn "\wide日本語\narrow"
#langdef ita "Italian"
#langdef spa "Spanish"
#langdef ger "German"
#langdef por "Portuguese"


//
// These Bvdt data will be updated by GetBvdtInfo function from BvdtLib library.
//
#string STR_MISC_BIOS_VERSION            #language eng  "Fake Data"
#string STR_MISC_SYSTEM_PRODUCT_NAME     #language eng  "Fake Data"
#string STR_CCB_VERSION                  #language eng  "Fake Data"


#string STR_INTERNAL_EFI_SHELL         #language eng  "[Internal EFI Shell]"
                                       #language fra  "[la Coquille interne de EFI]"
                                       #language zho  "[\wide內部\narrowEFI Shell]"
                                       #language jpn  "[\wideインターナル\narrowEFI\wideシェール\narrow]"
                                       #language ita  "[Shell EFI Interna]"
                                       #language spa  "[Interna EFI Shell]"
                                       #language ger  "[Internal EFI-Hülle]"
                                       #language por  "[Interna EFI Shell]"

#string STR_LEGACY_BOOT_A              #language eng  "[Internal Legacy Boot A:]"
                                       #language fra  "[Amorce Legacy interne A:]"
                                       #language zho  "[\wide內部傳統開機\narrowA:]"
                                       #language jpn  "[\wideインターナルレガシィブート\narrowA：]"
                                       #language ita  "[Legacy boot da A:]"
                                       #language spa  "[Interna Legacy Boot A:]"
                                       #language ger  "[Internal Erbschaft Aufputsch A:]"
                                       #language por  "[Interna Legacy Boot A:]"

#string STR_PROCESSED_ALL_BOOT_OPTIONS #language eng  "[ProcessedAllBootOptions(): Load shell from the FV]"
                                       #language fra  "[ProcessedAllBootOptions (): shell charge de la FV]"
                                       #language zho  "[ProcessedAllBootOptions (): \wide由\narrowFV\wide載入\narrowShell]"
                                       #language jpn  "[\wideプロセスオルブートオプション\narrow()FV\wideからシェールをロードする\narrow]"
                                       #language ita  "[ProcessedAllBootOptions(): Carica shell dallo FV]"
                                       #language spa  "Procesado todas las opciones de arranques (): cargar capa desde FV"
                                       #language ger  "[Prozess. Alle Aufputschoptionen von FV-Aufl]"
                                       #language por  "[Todos os processados Opções de Inicialização (): carga shell a partir de FV]"
#string STR_BOOT_FAILED                #language eng  "Boot Failed"
                                       #language fra  "Démarrage Echoué"
                                       #language zho  "\wide開機失敗\narrow"
                                       #language jpn  "\wideブート失敗\narrow"
                                       #language ita  "Boot Fallito"
                                       #language spa  "Arranque fallecido"
                                       #language ger  "Aufladung versagt"
                                       #language por  "Boot falhada"

#string STR_BOOT_SUCCEEDED             #language eng  "Boot Succeeded - "
                                       #language fra  "Démarrage Réussi"
                                       #language zho  "\wide開機成功\narrow"
                                       #language jpn  "\wideブート成功\narrow"
                                       #language ita  "Boot OK"
                                       #language spa  "Arranque satisfactorio"
                                       #language ger  "Aufladung erfolgreich"
                                       #language por  "Boot Sucedido"

#string STR_DEFAULT_TIMEOUT_BANNER     #language eng  "Default boot selection will be booted in "
                                       #language fra  "Sélection de démarrage par défaut sera lancée"
                                       #language zho  "\wide預設開機選擇項目將被載入\narrow"
                                       #language jpn  "\wideディフォルトブートオプションを起動する\narrow"
                                       #language ita  "Il sistema sia avvierà dal boot di default in"
                                       #language spa  "Selección de arranque predeterminado será arrancado en"
                                       #language ger  "Umlenkung Aufladungsauswahl wird erfolgen"
                                       #language por  "Seleção de boot de padrão será iniciado em"

#string STR_SECONDS                    #language eng  " seconds"
                                       #language fra  " Secondes"
                                       #language zho  " \wide秒\narrow"
                                       #language jpn  " \wide秒\narrow"
                                       #language ita  " secondi"
                                       #language spa  " Segundo"
                                       #language ger  " Sekunden"
                                       #language por  " Segundos"

#string STR_EXIT_DATA                  #language eng  "ExitData: "
                                       #language fra  "ExitData: "
                                       #language zho  "\wide離開資料\narrow:"
                                       #language jpn  "\wideデータ終了\narrow:"
                                       #language ita  "ExitData:"
                                       #language spa  "Salida de datos:"
                                       #language ger  "Ausgangsdaten:"
                                       #language por  "Saida de dados:"

#string STR_LOADING                    #language eng  "Loading: "
                                       #language fra  "Chargement: "
                                       #language zho  "\wide載入中\narrow:"
                                       #language jpn  "\wideローディング\narrow:"
                                       #language ita  "Sto caricando:"
                                       #language spa  "Cargando:"
                                       #language ger  "Aufladung:"
                                       #language por  "Carregando:"
#string STR_ENTER_NORMAL_BOOT          #language eng  "Entering Normal Boot Process..."
                                       #language fra  "Saisie processus de démarrage normal..."
                                       #language zho  "\wide正進入正常開機程序\narrow..."
                                       #language jpn  "\wide正常起動プロセスの実行中\narrow..."
                                       #language ita  "Avvio sequenza normale di Boot..."
                                       #language spa  "Entrando al proceso de arranque normal..."
                                       #language ger  "Betreten des Normalaufbauprozesses..."
                                       #language por  "Entrando ao processo de boot normal..."

#string STR_BIOS_VERSION_STRING        #language eng  "InsydeH2O version"
                                       #language fra  "InsydeH2O version"
                                       #language zho  "InsydeH2O\wide版本\narrow"
                                       #language jpn  "InsydeH2O\wideバージョン\narrow"
                                       #language ita  "Versione InsydeH2O"
                                       #language spa  "Versión de la InsydeH2O"
                                       #language ger  "InsydeH2O-Version"
                                       #language por  "Versão de InsydeH2O"

#string STR_CPU_TYPE_STRING            #language eng  "Processor Type"
                                       #language fra  "Processor Type"
                                       #language zho  "\wide處理器類型\narrow"
                                       #language jpn  "\wideプロセッサータイプ\narrow"
                                       #language ita  "Modello Processore"
                                       #language spa  "Tipo del procesador"
                                       #language ger  "Prozessortyp"
                                       #language por  "Tipo de Processador"

#string STR_SYSTEM_MEMORY_SPEED_STRING #language eng  "System Memory Speed"
                                       #language fra  "System Memory Speed"
                                       #language zho  "\wide系統記憶體速度\narrow"
                                       #language jpn  "\wideシステムメモリスピード\narrow"
                                       #language ita  "Frequenza Memoria di Sistema"
                                       #language spa  "Velocidad de la memoria del sistema"
                                       #language ger  "Systemspeicherungsgeschwindigkeit"
                                       #language por  "Velocidade da Memória do Sistema"

#string STR_ACPI30_BOOT_STRING         #language eng  "ACPI Selection"
                                       #language fra  "ACPI Selection"
                                       #language zho  "ACPI\wide選擇\narrow"
                                       #language jpn  "ACPI\wideオプション\narrow"
                                       #language ita  "Selezione ACPI"
                                       #language spa  "Selección de la ACPI"
                                       #language ger  "ACPI-Auswahl"
                                       #language por  "Seleção de ACPI"

#string STR_ACPI10B_TEXT               #language eng  "Acpi1.0B"
                                       #language fra  "Acpi1.0B"
                                       #language zho  "Acpi1.0B"
                                       #language jpn  "Acpi1.0B"
                                       #language ita  "Acpi1.0B"
                                       #language spa  "Acpi1.0B"
                                       #language ger  "Acpi1.0B"
                                       #language por  "Acpi1.0B"

#string STR_ACPI30_TEXT                #language eng  "Acpi3.0"
                                       #language fra  "Acpi3.0"
                                       #language zho  "Acpi3.0"
                                       #language jpn  "Acpi3.0"
                                       #language ita  "Acpi3.0"
                                       #language spa  "Acpi3.0"
                                       #language ger  "Acpi3.0"
                                       #language por  "Acpi3.0"

#string STR_PERFORM_MEM_TEST           #language eng  "Perform memory test (DEL to skip)"
                                       #language fra  "Exécute l'examen de mémoire (DEL pour sauter)"
                                       #language zho  "\wide進行記憶體測試\narrow(\wide按\narrowDEL\wide以略過\narrow)"
                                       #language jpn  "\wideメモリテストを実行する\narrow(\wideスキップにする場合、\narrowDEL\wideを押してください\narrow)"
                                       #language ita  "Avvio controllo memoria (DEL per interrompere)"
                                       #language spa  "Testeo del desempeño de la memoria (DEL para saltar)"
                                       #language ger  "Vorführung des Speichertestes DEL überspr"
                                       #language por  "Faça o teste de memória (DEL para saltar)"

#string STR_MEMORY_TEST_PERCENT        #language eng  "% of the system memory tested OK"
                                       #language fra  "% de la mémoire de système essayée D'ACCORD"
                                       #language zho  "%\wide之系統記憶體已測試無誤\narrow"
                                       #language jpn  "\wideシステムメモリ\narrow%\wide検査をパスした\narrow"
                                       #language ita  "% della memoria di sistema controllata OK"
                                       #language spa  "% de la memoria del sistema testeado OK"
                                       #language ger  "% des Speichersystems i.O. getestet"
                                       #language por  "% Da memória do sistema testado OK"

#string STR_DEL_TO_SKIP_MEM_TEST       #language eng  "Press DEL key to skip memory test"
                                       #language fra  "Appuie sur DEL sauter examen de mémoire"
                                       #language zho  "\wide按下\narrowDEL\wide鍵以略過記憶體測試\narrow"
                                       #language jpn  "DEL\wideキーを押し、メモリテストをスキップする\narrow"
                                       #language ita  "Premere DEL per saltare il test della memoria"
                                       #language spa  "Pulse tecla DEL para saltar el testeo de la memoria"
                                       #language ger  "Drück DEL-Schl. um Speichertest z.überspr"
                                       #language por  "Pressione tecla DEL para saltar o teste de memória"

#string STR_MEM_TEST_COMPLETED         #language eng  " bytes of system memory tested OK"
                                       #language fra  " octets dela mémoire de système essayée D'ACCORD"
                                       #language zho  " \wide系統記憶體位元組測試無誤\narrow"
                                       #language jpn  " \wideシステムメモリバイト検査をパスした\narrow"
                                       #language ita  " bytes della memoria di sistema testati OK"
                                       #language spa  " Bits del testeo de la memoria del sistema OK"
                                       #language ger  " Bytes des Systemspeichers getested und i.O"
                                       #language por  " Bytes de memória do sistema testado OK"

#string STR_NO_EXT_MEM_FOUND           #language eng  "Memory resource updated!"
                                       #language fra  "la mémoire Non étendue trouvée!"
                                       #language zho  "\wide記憶體資源已更新\narrow!"
                                       #language jpn  "\wideメモリリソース更新\narrow"
                                       #language ita  "Risorsa Memoria aggiornata!"
                                       #language spa  "Actualización del recurso de la memoria!"
                                       #language ger  "Speicherquelle aufdatiert"
                                       #language por  "Recurso de memória atualizada!"

#string STR_SYSTEM_MEM_ERROR           #language eng  "System encounters memory errors"
                                       #language fra  "le Système rencontre les erreurs de mémoire"
                                       #language zho  "\wide系統發生記憶體錯誤\narrow"
                                       #language jpn  "\wideシステムにはメモリエラー発生する\narrow"
                                       #language ita  "Il Sistema ha incontrato errori di memoria"
                                       #language spa  "Sistema encontró error de memoria"
                                       #language ger  "System empfängt Speicherfehler"
                                       #language por  "O sistema encontra erros de memória"

#string STR_START_BOOT_OPTION          #language eng  "Start boot option"
                                       #language fra  "l'option de botte de Début"
                                       #language zho  "\wide開始開機選項\narrow"
                                       #language jpn  "\wideブートオプションをスタートする\narrow"
                                       #language ita  "Opzioni Start boot"
                                       #language spa  "Opciones de l inicio de arranque"
                                       #language ger  "Beginn Aufbildoption"
                                       #language por  "Iniciar opção de boot"



#string STR_RECOVERY_FLASH_TITLE       #language eng  "Do you want to recovery ROM part? (Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language fra  "Voulez-vous récupérer ROM part? (Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language zho  "\wide是否回復快閃記憶體內容\narrow? \wide(警告: 並非所有的作業系統皆可在回復模式下開機)\narrow"
                                       #language jpn  "\wideロム部分を回復しますか\narrow? (Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language ita  "Vuoi effettuare il recovery della ROM? (Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language spa  "Quiere recuperar la parte ROM? (Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language ger  "Möchten Sie ROM-Teile rückgewinnen? (Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language por  "Você quer fazer recuperação da parte ROM ? (Caution: Not every OS is bootable in Recovery Mode.)"

#string STR_RECOVERY_FLASH_STATUS      #language eng  "Flash Status"
                                       #language fra  "Statut Flash"
                                       #language zho  "\wide快閃記憶體狀態\narrow"
                                       #language jpn  "\wideフラッシュ状態\narrow"
                                       #language ita  "Stato Flash"
                                       #language spa  "Estados de la Flash"
                                       #language ger  "Aufleuchtstatus"
                                       #language por  "Status da Flash"

#string STR_RECOVERY_FLASH_YES         #language eng  "YES, this choice will flash Rom part."
                                       #language fra  "Oui, ce choix renouvellera Rom part."
                                       #language zho  "\wide是，此選項將更新快閃記憶體內容\narrow"
                                       #language jpn  "\wideはい、ロム部分をフラッシュにする\narrow"
                                       #language ita  "YES, questa scelta avvia la programmazione della ROM."
                                       #language spa  "Si, esta opción se flasheara la parte de Rom."
                                       #language ger  "Ja, dieses wird ROM-Teil wählen"
                                       #language por  "Sim, esta escolha irá piscar a parte de Rom"

#string STR_RECOVERY_FLASH_RESETSYSTEM #language eng  "NO, abort Recovery mode and restart system."
                                       #language fra  "NO, abort Recovery mode and restart system."
                                       #language zho  "\wide否，取消回復模式並重新啟動系統\narrow"
                                       #language jpn  "NO, abort Recovery mode and restart system."
                                       #language ita  "NO, abort Recovery mode and restart system."
                                       #language spa  "NO, abort Recovery mode and restart system."
                                       #language ger  "NO, abort Recovery mode and restart system."
                                       #language por  "NO, abort Recovery mode and restart system."

#string STR_RECOVERY_FLASH_NO          #language eng  "NO, boot to OS now."
                                       #language fra  "NON, démarrez à OS maintenant."
                                       #language zho  "\wide否，現在開機進入作業系統\narrow"
                                       #language jpn  "\wideいいえ、今\narrowOS\wideを起動する\narrow"
                                       #language ita  "NO, avvia l'OS adesso"
                                       #language spa  "No, iniciar sistema operativo ahora."
                                       #language ger  "Nein, nun Aufpusch zu OS"
                                       #language por  "NÃO boot para o OS agora"

#string STR_RECOVERY_FLASH_REBOOT      #language eng  "Rebooting !"
                                       #language fra  "Redémarrez!"
                                       #language zho  "\wide重新開機\narrow!"
                                       #language jpn  "\wide再起動中\narrow!"
                                       #language ita  "Riavvio!"
                                       #language spa  "Reiniciar!"
                                       #language ger  "Wiederaufpuschen!"
                                       #language por  "Reiniciando!"

#string STR_BIOS_BUILD_DATE            #language eng  "BIOS Build Date"
                                       #language fra  "BIOS Build Date"
                                       #language zho  "BIOS\wide建立日期\narrow"
                                       #language jpn  "BIOS\wide作成日\narrow"
                                       #language ita  "Data di build del BIOS"
                                       #language spa  "Fecha de BIOS Buile"
                                       #language ger  "BIOS-Buile-Daten"
                                       #language por  "Data da BIOS Buile"
#string STR_CHECK_PASSWORD_STRING      #language eng        "Enter Current Password:"
                                       #language fra        "Entrer Mot de Passe Present:"
                                       #language zho        "\wide輸入密碼\narrow:"
                                       #language jpn        "\wide現在のパスワードを入力してください\narrow:"
                                       #language ita        "Digitare password attuale:"
                                       #language spa        "Ingrese Contrasena Actual:"
                                       #language ger        "Aktuelles Kennwort eintragen:"
                                       #language por        "Entre Senha Corrente:"
#string STR_INVALID_PASSWORD           #language eng        "Invalid password"
                                       #language fra        "Invalid password"
                                       #language zho        "\wide密碼錯誤\narrow"
                                       #language jpn        "Invalid password"
                                       #language ita        "Invalid password"
                                       #language spa        "Invalid password"
                                       #language ger        "Invalid password"
                                       #language por        "Invalid password"

#string STR_AUTO_FAILOVER_DISABLE_BOOT_FAIL  #language eng  "Default Boot Device Missing or Boot Failed.\nInsert Recovery Media and Hit any key.\nThen Select 'Boot Manager' to choose a new Boot Device or to Boot Recovery Media"
#string STR_AUTO_FAILOVER_NO_BOOT_DEVICE     #language eng  "Default Boot Device Missing or Boot Failed.\nInsert Recovery Media and Hit any key \nThen Select 'Boot Manager' to choose a new Boot Device or to Boot Recovery Media"

#string STR_USB_OPTION_INEXISTENCE     #language eng        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language fra        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language zho        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language jpn        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language ita        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language spa        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language ger        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language por        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
#string STR_CD_OPTION_INEXISTENCE      #language eng        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language fra        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language zho        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language jpn        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language ita        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language spa        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language ger        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language por        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
#string STR_NETWORK_OPTION_INEXISTENCE #language eng        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language fra        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language zho        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language jpn        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language ita        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language spa        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language ger        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language por        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."

#string STR_SELECT_USB_OPTION          #language eng        "Which USB boot option do you want to select?"
                                       #language fra        "Which USB boot option do you want to select?"
                                       #language zho        "Which USB boot option do you want to select?"
                                       #language jpn        "Which USB boot option do you want to select?"
                                       #language ita        "Which USB boot option do you want to select?"
                                       #language spa        "Which USB boot option do you want to select?"
                                       #language ger        "Which USB boot option do you want to select?"
                                       #language por        "Which USB boot option do you want to select?"
#string STR_SELECT_CD_OPTION           #language eng        "Which CD/DVD boot option do you want to select?"
                                       #language fra        "Which CD/DVD boot option do you want to select?"
                                       #language zho        "Which CD/DVD boot option do you want to select?"
                                       #language jpn        "Which CD/DVD boot option do you want to select?"
                                       #language ita        "Which CD/DVD boot option do you want to select?"
                                       #language spa        "Which CD/DVD boot option do you want to select?"
                                       #language ger        "Which CD/DVD boot option do you want to select?"
                                       #language por        "Which CD/DVD boot option do you want to select?"
#string STR_SELECT_NETWORK_OPTION      #language eng        "Which network boot option do you want to select?"
                                       #language fra        "Which network boot option do you want to select?"
                                       #language zho        "Which network boot option do you want to select?"
                                       #language jpn        "Which network boot option do you want to select?"
                                       #language ita        "Which network boot option do you want to select?"
                                       #language spa        "Which network boot option do you want to select?"
                                       #language ger        "Which network boot option do you want to select?"
                                       #language por        "Which network boot option do you want to select?"
#string STR_TIMEOUT_CHANGE             #language eng        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language fra        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language zho        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language jpn        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language ita        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language spa        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language ger        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language por        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
#string STR_BOOT_TYPE_CHANGE_CONFIRM   #language eng        "The Boot type is changed from %s to %s by other tools. Do you want to change"
                                       #language fra        "The Boot type is changed from %s to %s by other tools. Do you want to change"
                                       #language zho        "The Boot type is changed from %s to %s by other tools. Do you want to change"
                                       #language jpn        "The Boot type is changed from %s to %s by other tools. Do you want to change"
                                       #language ita        "The Boot type is changed from %s to %s by other tools. Do you want to change"
                                       #language spa        "The Boot type is changed from %s to %s by other tools. Do you want to change"
                                       #language ger        "The Boot type is changed from %s to %s by other tools. Do you want to change"
                                       #language por        "The Boot type is changed from %s to %s by other tools. Do you want to change"
#string STR_BOOT_TYPE_CHANGE           #language eng        "The Boot type is changed from %s to %s. Please press any key to restart."
                                       #language fra        "The Boot type is changed from %s to %s. Please press any key to restart."
                                       #language zho        "The Boot type is changed from %s to %s. Please press any key to restart."
                                       #language jpn        "The Boot type is changed from %s to %s. Please press any key to restart."
                                       #language ita        "The Boot type is changed from %s to %s. Please press any key to restart."
                                       #language spa        "The Boot type is changed from %s to %s. Please press any key to restart."
                                       #language ger        "The Boot type is changed from %s to %s. Please press any key to restart."
                                       #language por        "The Boot type is changed from %s to %s. Please press any key to restart."
